#+TITLE: Configs & Dotfiles
#+AUTHOR: Vishakh Kumar
#+EMAIL: vishakhpradeepkumar@gmail.com
#+LICENSE: GPLv3
#+LANGUAGE: en
#+OPTIONS: num:5 whn:2 toc:4 H:6

#+COLUMNS: %25ITEM %TODO %3PRIORITY %TAGS


:padline no

**** bash aliases

 Bash aliases are always rather useful, especially when you're tired/lazy and you just wanna get things done.
 While I'll be listing a couple of bash aliases over here, I've be placing bash aliases specific to a program else wherever that program is being described.

 You can see all bash aliases by typing
 #+BEGIN_SRC sh
 cat terminalEmulator/bash/bash_aliases.txt
 #+END_SRC
 #+RESULTS:
 | alias | gs='git    | status   | '       |         |
 | alias | ga='git    | add      | '       |         |
 | alias | gb='git    | branch   | '       |         |
 | alias | gam='git   | commit   | --amend | '       |
 | alias | gc='git    | commit'  |         |         |
 | alias | gd='git    | diff'    |         |         |
 | alias | gt='git    | checkout | '       |         |
 | alias | gk='gitk   | --all&'  |         |         |
 | alias | gx='gitx   | --all'   |         |         |
 | alias | pull='git  | pull'    |         |         |
 | alias | pullo='git | pull     | origin' |         |
 | alias | push='git  | push'    |         |         |
 | alias | pusho='git | push     | origin' |         |
 | alias | pushf='git | push     | -f      | origin' |
 | alias | pushu='git | push     | -u      | origin' |
 | alias | merge='git | merge'   |         |         |
 | alias | got='git   | '        |         |         |
 | alias | get='git   | '        |         |         |
 | alias | clone='git | clone'   |         |         |
 | alias | add='git   | add'     |         |         |

